//******************************************************************************
// Имя файла    :  'SysTick.c'
// заголовок    :  Постоянный глобальный таймер
// Автор        :  Маньянов Р.Р.
// Контакты     :  
// Дата         :  13.05.2014 
//******************************************************************************

#include "systick.h"
    
// приоритет прерывания глобального таймера (0..15)
#define SYSTICK_PRIORITY    0x01
// Глобальный счётчик миллисекунд
volatile uint32_t globalTimer;

//==============================================================================
//                    Инициализация глобального таймера
//------------------------------------------------------------------------------
// frequence    - частота глобального таймера
// uSTimer      - управление микросекундным таймером (0 - выкл, 1 - вкл)  
// return       - результат инициализации (0 - неудачно, 1 - успешно)
//==============================================================================

uint8_t SysTickInit(uint16_t frequence) {
    SystemCoreClockUpdate();
    if(SysTick_Config(SystemCoreClock / frequence))
        return 0;
    NVIC_SetPriority(SysTick_IRQn, SYSTICK_PRIORITY);
    return 1;
}

//==============================================================================
//                  Деинициализация глобального таймера
//==============================================================================

void SysTickDeinit (void)
{
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE;
}

//==============================================================================
//                Получение текущего системного времени
//------------------------------------------------------------------------------
// return   - текущее системное время
//==============================================================================

uint32_t SysTickGet (void)
{
    return globalTimer;
}

//==============================================================================
//                   Итерация отсчёта глобального таймера 
//==============================================================================

void SysTick_Handler(void)
{     
    globalTimer++;
}   

//==============================================================================
//                    Пауза в отсчётах глобального таймера  
//------------------------------------------------------------------------------
// delay    - длительность паузы в отсчётах глобального таймера
//==============================================================================

void delay_ms(uint16_t delay)
{
    uint32_t timer = globalTimer;
    while(globalTimer - timer <= delay);
}

//==============================================================================
//                      Микросекундная пауза
//------------------------------------------------------------------------------
// delay    - время паузы (мкс)
//==============================================================================

inline void delay_us(uint32_t us) {
    if (!us) return;
    uint32_t loops = SystemCoreClock / 1000000 * us / 12;
    while(--loops) { asm( "nop\n nop" );}
}
